In [1]:
import pandas as pd
import numpy as np

In [2]:
# Create dictionary of test scores
test_dict = {'Scotty':[63,75,88], 'Joy':[48,98,92],'Kamala': [87, 86, 85]}

# Create DataFrame
df = pd.DataFrame(test_dict)

# Display DataFrame
df

   Scotty  Joy  Kamala
0      63   48      87
1      75   98      86
2      88   92      85

In [3]:
# Transpose DataFrame
# A transpose turns rows into columns and columns into rows

df = df.T
df

         0   1   2
Scotty  63  75  88
Joy     48  98  92
Kamala  87  86  85

In [4]:
# Rename Columns
df.columns = ['Quiz_1', 'Quiz_2', 'Quiz_3']
df

        Quiz_1  Quiz_2  Quiz_3
Scotty      63      75      88
Joy         48      98      92
Kamala      87      86      85

In [5]:
# Access first row by index number
df.iloc[0]

Quiz_1    63
Quiz_2    75
Quiz_3    88
Name: Scotty, dtype: int64

In [6]:
# Access first column by name
df['Quiz_1']

Scotty    63
Joy       48
Kamala    87
Name: Quiz_1, dtype: int64

In [7]:
# Access first column using dot notation
df.Quiz_1

Scotty    63
Joy       48
Kamala    87
Name: Quiz_1, dtype: int64

In [8]:
# Limit DataFrame to first 2 rows
df[0:2]

        Quiz_1  Quiz_2  Quiz_3
Scotty      63      75      88
Joy         48      98      92

In [9]:
# Define new DataFrame - first 2 rows,  last 2 columns
rows = ['Scotty', 'Joy']
cols = ['Quiz_2', 'Quiz_3']
df_spring = df.loc[rows, cols]
df_spring

        Quiz_2  Quiz_3
Scotty      75      88
Joy         98      92

In [10]:
# Define new column as mean of other columns
# You can generate new columns in a variety of ways. One way is to use available methods such
# as the mean. In pandas, itâ€™s important to specify the axis. An axis of 0 represents the column,
# while an axis of 1 represents the rows.
df['Quiz_Avg'] = df.mean(axis=1)
df

        Quiz_1  Quiz_2  Quiz_3   Quiz_Avg
Scotty      63      75      88  75.333333
Joy         48      98      92  79.333333
Kamala      87      86      85  86.000000

In [11]:
df['Quiz_4'] = [92, 95, 88]
df

        Quiz_1  Quiz_2  Quiz_3   Quiz_Avg  Quiz_4
Scotty      63      75      88  75.333333      92
Joy         48      98      92  79.333333      95
Kamala      87      86      85  86.000000      88

In [12]:
# delete the Quiz_Avg column
del df['Quiz_Avg']
df

        Quiz_1  Quiz_2  Quiz_3  Quiz_4
Scotty      63      75      88      92
Joy         48      98      92      95
Kamala      87      86      85      88

In [13]:
# New student joined the class without score for Quiz_1, Quiz_2 and Quiz_3
df.loc['Adrian']=[np.NaN, np.NaN, np.NaN, 71]
df

        Quiz_1  Quiz_2  Quiz_3  Quiz_4
Scotty    63.0    75.0    88.0    92.0
Joy       48.0    98.0    92.0    95.0
Kamala    87.0    86.0    85.0    88.0
Adrian     NaN     NaN     NaN    71.0

In [14]:
# Find the mean value while ignoring NaN and use these values to create a new column named Quiz_Avg
df['Quiz_Avg'] = df.mean(axis=1, skipna=True)
df

        Quiz_1  Quiz_2  Quiz_3  Quiz_4  Quiz_Avg
Scotty    63.0    75.0    88.0    92.0     79.50
Joy       48.0    98.0    92.0    95.0     83.25
Kamala    87.0    86.0    85.0    88.0     86.50
Adrian     NaN     NaN     NaN    71.0     71.00

In [15]:
# Cast all the types of Quiz_Avg from float to int
df.Quiz_4.astype(int)

Scotty    92
Joy       95
Kamala    88
Adrian    71
Name: Quiz_4, dtype: int64